wentong-li/sdk-nrf/applications/nrf5340_audio/ext/cirrus_logic/common/system_test_hw_0/hw_0_bsp.c
/**
 * @file hw_0_bsp.c
 *
 * @brief Implementation of the BSP for the HW ID0 platform.
 *
 * @copyright
 * Copyright (c) Cirrus Logic 2020 All Rights Reserved, http://www.cirrus.com/
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */
/***********************************************************************************************************************
 * INCLUDES
 **********************************************************************************************************************/
#include <stdlib.h>
#include "hw_0_bsp.h"
#include "stm32f4xx_hal.h"
#include "test_tone_tables.h"
#ifndef NO_OS
#include "FreeRTOS.h"
#endif

/***********************************************************************************************************************
 * LOCAL LITERAL SUBSTITUTIONS
 **********************************************************************************************************************/
#define BSP_MCU_CLOCK_CFG_HSI           (0)
#define BSP_MCU_CLOCK_CFG_HSE           (1)
#define BSP_MCU_CLOCK_CFG               (BSP_MCU_CLOCK_CFG_HSI)

#define BSP_I2C_TRANSACTION_TYPE_WRITE                  (0)
#define BSP_I2C_TRANSACTION_TYPE_READ_REPEATED_START    (1)
#define BSP_I2C_TRANSACTION_TYPE_DB_WRITE               (2)
#define BSP_I2C_TRANSACTION_TYPE_INVALID                (3)

/* I2S peripheral configuration defines */
#define I2S_HW                          SPI2
#define I2S_CLK_ENABLE()                __HAL_RCC_SPI2_CLK_ENABLE()
#define I2S_CLK_DISABLE()               __HAL_RCC_SPI2_CLK_DISABLE()
#define I2S_LRCLK_SCLK_SDOUT_AF         GPIO_AF5_SPI2
#define I2S_SDIN_AF                     GPIO_AF6_I2S2ext
#define I2S_GPIO_PORT_CLK_ENABLE()      __HAL_RCC_GPIOB_CLK_ENABLE()
#define I2S_GPIO_PORT                   GPIOB
#define I2S_LRCLK_GPIO_PIN              GPIO_PIN_12
#define I2S_SCLK_GPIO_PIN               GPIO_PIN_13
#define I2S_SDOUT_GPIO_PIN              GPIO_PIN_15
#define I2S_SDIN_PIN                    GPIO_PIN_14

/* I2S DMA Stream definitions */
#define I2S_TX_DMAx_CLK_ENABLE()        __HAL_RCC_DMA1_CLK_ENABLE()
#define I2S_TX_DMAx_CLK_DISABLE()       __HAL_RCC_DMA1_CLK_DISABLE()
#define I2S_TX_DMAx_STREAM              DMA1_Stream4
#define I2S_TX_DMAx_CHANNEL             DMA_CHANNEL_0
#define I2S_TX_DMAx_IRQ                 DMA1_Stream4_IRQn
#define I2S_TX_DMAx_PERIPH_DATA_SIZE    DMA_PDATAALIGN_HALFWORD
#define I2S_TX_DMAx_MEM_DATA_SIZE       DMA_MDATAALIGN_HALFWORD
#define I2S_TX_IRQHandler               DMA1_Stream4_IRQHandler

#define I2S_RX_DMAx_CLK_ENABLE()        __HAL_RCC_DMA1_CLK_ENABLE()
#define I2S_RX_DMAx_CLK_DISABLE()       __HAL_RCC_DMA1_CLK_DISABLE()
#define I2S_RX_DMAx_STREAM              DMA1_Stream3
#define I2S_RX_DMAx_CHANNEL             DMA_CHANNEL_3
#define I2S_RX_DMAx_IRQ                 DMA1_Stream3_IRQn
#define I2S_RX_DMAx_PERIPH_DATA_SIZE    DMA_PDATAALIGN_HALFWORD
#define I2S_RX_DMAx_MEM_DATA_SIZE       DMA_MDATAALIGN_HALFWORD
#define I2S_RX_IRQHandler               DMA1_Stream3_IRQHandler

/* Select the interrupt preemption priority and subpriority for the DMA interrupt */
#define I2S_TX_IRQ_PREPRIO                      0x0E   /* Select the preemption priority level(0 is the highest) */
#define I2S_RX_IRQ_PREPRIO                      0x0F   /* Select the preemption priority level(0 is the highest) */

/* Definition for USART2 HW resources */
#define USART2_CLK_ENABLE()                     __HAL_RCC_USART2_CLK_ENABLE();
#define USART2_RX_GPIO_CLK_ENABLE()             __HAL_RCC_GPIOA_CLK_ENABLE()
#define USART2_TX_GPIO_CLK_ENABLE()             __HAL_RCC_GPIOA_CLK_ENABLE()
#define USART2_FORCE_RESET()                    __HAL_RCC_USART2_FORCE_RESET()
#define USART2_RELEASE_RESET()                  __HAL_RCC_USART2_RELEASE_RESET()
#define USART2_TX_PIN                           GPIO_PIN_2
#define USART2_TX_GPIO_PORT                     GPIOA
#define USART2_TX_AF                            GPIO_AF7_USART2
#define USART2_RX_PIN                           GPIO_PIN_3
#define USART2_RX_GPIO_PORT                     GPIOA
#define USART2_RX_AF                            GPIO_AF7_USART2
#define USART2_IRQ_PREPRIO                      0x0F

#define USART2_TX_BUFFER_SIZE_BYTES             (1024)
#define USART2_RX_BUFFER_SIZE_BYTES             USART2_TX_BUFFER_SIZE_BYTES

/* BSP Audio Format definitions */
#define BSP_I2S_STANDARD                        I2S_STANDARD_PHILIPS
#define BSP_I2S_FS_HZ                           (I2S_AUDIOFREQ_48K)
#define BSP_I2S_WORD_SIZE_BITS                  (32)
#if (BSP_I2S_WORD_SIZE_BITS == 32)
    #define BSP_I2S_DATA_FORMAT                 (I2S_DATAFORMAT_32B)
    #define BSP_I2S_SUBFRAME_SIZE_BITS          (32)
    #define BSP_I2S_2BYTES_PER_SUBFRAME         (2)
#elif (BSP_I2S_WORD_SIZE_BITS == 24)
    #define BSP_I2S_DATA_FORMAT                 (I2S_DATAFORMAT_24B)
    #define BSP_I2S_SUBFRAME_SIZE_BITS          (32)
    #define BSP_I2S_2BYTES_PER_SUBFRAME         (2)
#elif (BSP_I2S_WORD_SIZE_BITS == 16)
    #define BSP_I2S_DATA_FORMAT                 (I2S_DATAFORMAT_16B)
    #define BSP_I2S_SUBFRAME_SIZE_BITS          (16)
    #define BSP_I2S_2BYTES_PER_SUBFRAME         (1)
#else
#error "BSP_I2S_WORD_SIZE_BITS is unsupported"
#endif
#define BSP_I2S_WORD_SIZE_BYTES                 (BSP_I2S_WORD_SIZE_BITS/8)
#define BSP_I2S_SUBFRAME_SIZE_BYTES             (BSP_I2S_SUBFRAME_SIZE_BITS/8)
#define BSP_I2S_CHANNEL_NBR                     (2)

#ifdef TEST_TONES_INCLUDE_100HZ
/* Playback PCM buffer size of 10ms */
#define PLAYBACK_BUFFER_SIZE_SUBFRAMES          (BSP_I2S_FS_HZ / 100 * BSP_I2S_CHANNEL_NBR)
#else
/* Playback PCM buffer size of 1ms */
#define PLAYBACK_BUFFER_SIZE_SUBFRAMES          (BSP_I2S_FS_HZ / 1000 * BSP_I2S_CHANNEL_NBR)
#endif
#define PLAYBACK_BUFFER_SIZE_2BYTES             (PLAYBACK_BUFFER_SIZE_SUBFRAMES * BSP_I2S_2BYTES_PER_SUBFRAME)
#define BSP_I2S_DMA_SIZE                        (PLAYBACK_BUFFER_SIZE_SUBFRAMES)
#define PLAYBACK_BUFFER_DEFAULT_VALUE           (0xABCD)
#define PLAYBACK_BUFFER_DEFAULT_L_VALUE         (0x1234)
#define PLAYBACK_BUFFER_DEFAULT_R_VALUE         (0xABCD)
#define RECORD_BUFFER_SIZE_2BYTES               (PLAYBACK_BUFFER_SIZE_2BYTES)
#define RECORD_BUFFER_DEFAULT_VALUE             (0xEEEE)

#define BSP_DUT_RESET_CLK_ENABLE                __HAL_RCC_GPIOC_CLK_ENABLE
#define BSP_DUT_RESET_CLK_DISABLE               __HAL_RCC_GPIOC_CLK_DISABLE
#define BSP_DUT_CDC_RESET_PIN                   GPIO_PIN_0
#define BSP_DUT_DSP_RESET_PIN                   GPIO_PIN_1
#define BSP_DUT_RESET_GPIO_PORT                 GPIOC
#define BSP_DUT_INT_CLK_ENABLE                  __HAL_RCC_GPIOA_CLK_ENABLE
#define BSP_DUT_INT_CLK_DISABLE                 __HAL_RCC_GPIOA_CLK_DISABLE
#ifndef CONFIG_L25B
#define BSP_DUT_CDC_INT_PIN                     GPIO_PIN_0
#define BSP_DUT_CDC_INT_GPIO_PORT               GPIOA
#else
#define BSP_DUT_CDC_INT_PIN                     GPIO_PIN_11
#define BSP_DUT_CDC_INT_GPIO_PORT               GPIOC
#endif
#define BSP_DUT_DSP_INT_PIN                     GPIO_PIN_10
#define BSP_DUT_DSP_INT_GPIO_PORT               GPIOA

#define BSP_DUT_CDC_INT_PREEMPT_PRIO            0xE
#define BSP_DUT_DSP_INT_PREEMPT_PRIO            0xF

#define BSP_LN2_RESET_CLK_ENABLE                __HAL_RCC_GPIOA_CLK_ENABLE
#define BSP_LN2_RESET_CLK_DISABLE               __HAL_RCC_GPIOA_CLK_DISABLE
#define BSP_LN2_RESET_PIN                       GPIO_PIN_6
#define BSP_LN2_RESET_GPIO_PORT                 GPIOA

#define BSP_GPIO_ID_LD2                         (0)

#define BSP_PB_TOTAL                            (1)

#define BSP_LN2_FPGA_I2C_ADDRESS_8BIT           (0x44)

#define BSP_LED_MODE_FIXED                      (0)
#define BSP_LED_MODE_BLINK                      (1)

typedef struct
{
    uint32_t id;
    uint8_t mode;
    bool is_on;
    uint32_t blink_counter_100ms;
    uint32_t blink_counter_100ms_max;
} bsp_led_t;

typedef struct
{
    uint32_t size;
    uint32_t in_index;
    uint32_t out_index;
    uint8_t *buffer;
} bsp_fifo_t;

