wentong-li/sdk-nrf/applications/nrf5340_audio/ext/cirrus_logic/common/system_test_hw_0/hw_0_bsp.c
     /* Set TIMx instance */
     tim_drv_handle.Instance = TIM2;

     /* Initialize TIM3 peripheral as follow:
          + Period = 10000 - 1
          + Prescaler = ((SystemCoreClock/2)/10000) - 1
          + ClockDivision = 0
          + Counter direction = Up
     */
     tim_drv_handle.Init.Period = 10000 - 1;
     tim_drv_handle.Init.Prescaler = uwPrescalerValue;
     tim_drv_handle.Init.ClockDivision = 0;
     tim_drv_handle.Init.CounterMode = TIM_COUNTERMODE_UP;
     tim_drv_handle.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;

    /* Set TIMx instance */
    led_tim_drv_handle.Instance = TIM5;

    // Configure LED blink timer for 100Hz/100ms delay
    /* Initialize TIM3 peripheral as follow:
         + Period = 1000 - 1
         + Prescaler = ((SystemCoreClock/2)/10000) - 1 = 10kHz
         + ClockDivision = 0
         + Counter direction = Up
    */
    led_tim_drv_handle.Init.Period = 1000 - 1;
    led_tim_drv_handle.Init.Prescaler = uwPrescalerValue;
    led_tim_drv_handle.Init.ClockDivision = 0;
    led_tim_drv_handle.Init.CounterMode = TIM_COUNTERMODE_UP;
    led_tim_drv_handle.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;

    if(HAL_TIM_Base_Init(&led_tim_drv_handle) != HAL_OK)
    {
      Error_Handler();
    }

    if(HAL_TIM_Base_Start_IT(&led_tim_drv_handle) != HAL_OK)
    {
      Error_Handler();
    }

    return;
}

static void Timer_Start(uint32_t delay_100us)
{
    if(HAL_TIM_Base_Stop_IT(&tim_drv_handle) != HAL_OK)
    {
      Error_Handler();
    }

    tim_drv_handle.Init.Period = delay_100us;
    if(HAL_TIM_Base_Init(&tim_drv_handle) != HAL_OK)
    {
      Error_Handler();
    }

    if(HAL_TIM_Base_Start_IT(&tim_drv_handle) != HAL_OK)
    {
      Error_Handler();
    }

    return;
}

static void UART_Init(void)
{
    uart_drv_handle.Instance          = USART2;
    uart_drv_handle.Init.BaudRate     = 115200;
    uart_drv_handle.Init.WordLength   = UART_WORDLENGTH_8B;
    uart_drv_handle.Init.StopBits     = UART_STOPBITS_1;
    uart_drv_handle.Init.Parity       = UART_PARITY_NONE;
    uart_drv_handle.Init.HwFlowCtl    = UART_HWCONTROL_NONE;
    uart_drv_handle.Init.Mode         = UART_MODE_TX;
    uart_drv_handle.Init.OverSampling = UART_OVERSAMPLING_16;

    if(HAL_UART_Init(&uart_drv_handle) != HAL_OK)
    {
        Error_Handler();
    }

    return;
}

int __io_putchar(int ch)
{
    uint32_t temp_in_index, temp_out_index;
    temp_in_index = uart_tx_fifo.in_index;

    // Wait while buffer is full
    do
    {
        __disable_irq();
        temp_out_index = uart_tx_fifo.out_index;
        __enable_irq();
    } while ((temp_in_index + 1) % uart_tx_fifo.size == temp_out_index);

    // Update input index and add char
    uart_tx_fifo.buffer[temp_in_index] = ch;
    uart_tx_fifo.in_index++;
    uart_tx_fifo.in_index %= uart_tx_fifo.size;

    // If UART is not transmitting, then kick off transmit
    if (temp_out_index == temp_in_index)
    {
        uint8_t *tx_buffer = uart_tx_fifo.buffer + uart_tx_fifo.out_index;

        HAL_UART_Transmit_IT(&uart_drv_handle, tx_buffer, 1);
    }

    return ch;
}

static void bsp_exti_pb_cb(void)
{
    bsp_pb_pressed_flags[BSP_PB_ID_USER] = true;
    if (bsp_pb_cbs[BSP_PB_ID_USER] != NULL)
    {
        bsp_pb_cbs[BSP_PB_ID_USER](BSP_STATUS_OK, bsp_pb_cb_args[BSP_PB_ID_USER]);
    }

    return;
}

static void bsp_exti_cdc_int_cb(void)
{
    if (bsp_dut_cdc_int_cb != NULL)
    {
        bsp_dut_cdc_int_cb(BSP_STATUS_OK, bsp_dut_cdc_int_cb_arg);
        app_cb(BSP_STATUS_DUT_EVENTS, app_cb_arg);
    }
    return;
}

static void bsp_exti_dsp_int_cb(void)
{
    if (bsp_dut_dsp_int_cb != NULL)
    {
        bsp_dut_dsp_int_cb(BSP_STATUS_OK, bsp_dut_dsp_int_cb_arg);
        app_cb(BSP_STATUS_DUT_EVENTS, app_cb_arg);
    }

    return;
}

/***********************************************************************************************************************
 * MCU HAL FUNCTIONS
 **********************************************************************************************************************/
void HAL_MspInit(void)
{
    GPIO_InitTypeDef GPIO_InitStruct = {0};

    // Enable clocks to ports used
    __HAL_RCC_GPIOA_CLK_ENABLE();
    __HAL_RCC_GPIOC_CLK_ENABLE();
    BSP_DUT_RESET_CLK_ENABLE();
    BSP_DUT_INT_CLK_ENABLE();
    BSP_LN2_RESET_CLK_ENABLE();

    // Configure the LD2 GPO
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_5, GPIO_PIN_RESET);
    GPIO_InitStruct.Pin = GPIO_PIN_5;
    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Alternate = 0;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

    // Configure the LN2 Reset GPO
    HAL_GPIO_WritePin(BSP_LN2_RESET_GPIO_PORT, BSP_LN2_RESET_PIN, GPIO_PIN_SET);
    GPIO_InitStruct.Pin = BSP_LN2_RESET_PIN;
    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Alternate = 0;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    HAL_GPIO_Init(BSP_LN2_RESET_GPIO_PORT, &GPIO_InitStruct);

    // Configure the codec Reset GPO
    HAL_GPIO_WritePin(BSP_DUT_RESET_GPIO_PORT, BSP_DUT_CDC_RESET_PIN, GPIO_PIN_SET);
    GPIO_InitStruct.Pin = BSP_DUT_CDC_RESET_PIN;
    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Alternate = 0;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    HAL_GPIO_Init(BSP_DUT_RESET_GPIO_PORT, &GPIO_InitStruct);

    // Configure the DSP Reset GPO
    HAL_GPIO_WritePin(BSP_DUT_RESET_GPIO_PORT, BSP_DUT_DSP_RESET_PIN, GPIO_PIN_SET);
    GPIO_InitStruct.Pin = BSP_DUT_DSP_RESET_PIN;
    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Alternate = 0;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    HAL_GPIO_Init(BSP_DUT_RESET_GPIO_PORT, &GPIO_InitStruct);

    // Configure Interrupt GPIs
    GPIO_InitStruct.Pin = BSP_DUT_CDC_INT_PIN;
    GPIO_InitStruct.Mode = GPIO_MODE_IT_FALLING;
    GPIO_InitStruct.Alternate = 0;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
    GPIO_InitStruct.Pull = GPIO_PULLUP;
    HAL_GPIO_Init(BSP_DUT_CDC_INT_GPIO_PORT, &GPIO_InitStruct);
    GPIO_InitStruct.Pin = BSP_DUT_DSP_INT_PIN;
    HAL_GPIO_Init(BSP_DUT_DSP_INT_GPIO_PORT, &GPIO_InitStruct);

    EXTI_ConfigTypeDef exti_config;

#ifndef CONFIG_L25B
    exti_config.Line = EXTI_LINE_0;
#else
    exti_config.Line = EXTI_LINE_11;
#endif
    exti_config.Mode = EXTI_MODE_INTERRUPT;
    exti_config.Trigger = EXTI_TRIGGER_FALLING;
    HAL_EXTI_SetConfigLine(&exti_cdc_int_handle, &exti_config);
    HAL_EXTI_RegisterCallback(&exti_cdc_int_handle, HAL_EXTI_COMMON_CB_ID, &bsp_exti_cdc_int_cb);

