wentong-li/sdk-nrf/applications/nrf5340_audio/ext/cirrus_logic/common/system_test_hw_0/hw_0_bsp.c
    exti_config.Line = EXTI_LINE_10;
    HAL_EXTI_SetConfigLine(&exti_dsp_int_handle, &exti_config);
    HAL_EXTI_RegisterCallback(&exti_dsp_int_handle, HAL_EXTI_COMMON_CB_ID, &bsp_exti_dsp_int_cb);

    // Configure the Push Button GPI
    GPIO_InitStruct.Pin = GPIO_PIN_13;
    GPIO_InitStruct.Mode = GPIO_MODE_IT_FALLING;
    GPIO_InitStruct.Alternate = 0;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

    exti_config.Line = EXTI_LINE_13;
    HAL_EXTI_SetConfigLine(&exti_pb_handle, &exti_config);
    HAL_EXTI_RegisterCallback(&exti_pb_handle, HAL_EXTI_COMMON_CB_ID, &bsp_exti_pb_cb);

    /* Enable and set Button EXTI Interrupt to the lowest priority */
    HAL_NVIC_SetPriority((IRQn_Type)EXTI15_10_IRQn, BSP_DUT_DSP_INT_PREEMPT_PRIO, 0x00);
    HAL_NVIC_EnableIRQ((IRQn_Type)EXTI15_10_IRQn);

#ifndef CONFIG_L25B
    /* Enable and set cdc EXTI Interrupt to a low priority */
    HAL_NVIC_SetPriority((IRQn_Type)EXTI0_IRQn, BSP_DUT_CDC_INT_PREEMPT_PRIO, 0x00);
    HAL_NVIC_EnableIRQ((IRQn_Type)EXTI0_IRQn);
#endif

    HAL_GPIO_WritePin(GPIOC, GPIO_PIN_5, GPIO_PIN_RESET);
    GPIO_InitStruct.Pin = GPIO_PIN_5;
    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Alternate = 0;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

    HAL_GPIO_WritePin(GPIOC, GPIO_PIN_2, GPIO_PIN_RESET);
    GPIO_InitStruct.Pin = GPIO_PIN_2;
    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Alternate = 0;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

    return;
}

/**
* @brief SPI MSP Initialization
* This function configures the hardware resources used in this example
* @param hspi: SPI handle pointer
* @retval None
*/
void HAL_SPI_MspInit(SPI_HandleTypeDef* hspi)
{
  GPIO_InitTypeDef GPIO_InitStruct = {0};
  if(hspi->Instance==SPI1)
  {
  /* USER CODE BEGIN SPI1_MspInit 0 */

  /* USER CODE END SPI1_MspInit 0 */
    /* Peripheral clock enable */
    __HAL_RCC_SPI1_CLK_ENABLE();

    __HAL_RCC_GPIOA_CLK_ENABLE();
    __HAL_RCC_GPIOB_CLK_ENABLE();
    /**SPI1 GPIO Configuration
    PB3     ------> SPI1_SCK
    PB4     ------> SPI1_MISO
    PB5     ------> SPI1_MOSI
    */

    /* Depending on minicard config, the SPI interface and SS will differ */
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_11, GPIO_PIN_SET);
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_15, GPIO_PIN_SET);
    GPIO_InitStruct.Pin = GPIO_PIN_11 | GPIO_PIN_15;
    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
    GPIO_InitStruct.Alternate = 0;
    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

    GPIO_InitStruct.Pin = GPIO_PIN_3 | GPIO_PIN_4 | GPIO_PIN_5;
    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    GPIO_InitStruct.Alternate = GPIO_AF5_SPI1;
    HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

  /* USER CODE BEGIN SPI1_MspInit 1 */

  /* USER CODE END SPI1_MspInit 1 */
  }

}

/**
* @brief SPI MSP De-Initialization
* This function freeze the hardware resources used in this example
* @param hspi: SPI handle pointer
* @retval None
*/
void HAL_SPI_MspDeInit(SPI_HandleTypeDef* hspi)
{
  if(hspi->Instance==SPI1)
  {
  /* USER CODE BEGIN SPI1_MspDeInit 0 */

  /* USER CODE END SPI1_MspDeInit 0 */
    /* Peripheral clock disable */
    __HAL_RCC_SPI1_CLK_DISABLE();

    /**SPI1 GPIO Configuration
    PA15     ------> SPI1_NSS
    PB3     ------> SPI1_SCK
    PB4     ------> SPI1_MISO
    PB5     ------> SPI1_MOSI
    */
    HAL_GPIO_DeInit(GPIOA, GPIO_PIN_11|GPIO_PIN_15);

    HAL_GPIO_DeInit(GPIOB, GPIO_PIN_3|GPIO_PIN_4|GPIO_PIN_5);

  /* USER CODE BEGIN SPI1_MspDeInit 1 */

  /* USER CODE END SPI1_MspDeInit 1 */
  }

}

void HAL_MspDeInit(void)
{
    HAL_GPIO_DeInit(GPIOA, GPIO_PIN_5);
    HAL_GPIO_DeInit(GPIOC, GPIO_PIN_13);

    HAL_GPIO_DeInit(BSP_DUT_RESET_GPIO_PORT, BSP_DUT_CDC_RESET_PIN);
    HAL_GPIO_DeInit(BSP_DUT_RESET_GPIO_PORT, BSP_DUT_DSP_RESET_PIN);
    HAL_GPIO_DeInit(BSP_DUT_CDC_INT_GPIO_PORT, BSP_DUT_CDC_INT_PIN);
    HAL_GPIO_DeInit(BSP_DUT_DSP_INT_GPIO_PORT, BSP_DUT_DSP_INT_PIN);
    HAL_GPIO_DeInit(BSP_LN2_RESET_GPIO_PORT, BSP_LN2_RESET_PIN);

    __HAL_RCC_GPIOA_CLK_DISABLE();
    __HAL_RCC_GPIOC_CLK_DISABLE();

    BSP_DUT_RESET_CLK_DISABLE();
    BSP_DUT_INT_CLK_DISABLE();
    BSP_LN2_RESET_CLK_DISABLE();

    return;
}

void HAL_TIM_Base_MspInit(TIM_HandleTypeDef *htim)
{
    if (htim->Instance == TIM2)
    {
        __HAL_RCC_TIM2_CLK_ENABLE();
        HAL_NVIC_SetPriority(TIM2_IRQn, 4, 0);
        HAL_NVIC_EnableIRQ(TIM2_IRQn);
    }

    if (htim->Instance == TIM5)
    {
        __HAL_RCC_TIM5_CLK_ENABLE();
        HAL_NVIC_SetPriority(TIM5_IRQn, 4, 0);
        HAL_NVIC_EnableIRQ(TIM5_IRQn);
    }

    return;
}

void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
    if (htim->Instance == TIM2)
    {
        if (bsp_timer_has_started)
        {
            if(HAL_TIM_Base_Stop_IT(&tim_drv_handle) != HAL_OK)
            {
              Error_Handler();
            }

            bsp_timer_elapsed = true;

            if (bsp_timer_cb != NULL)
            {
                bsp_timer_cb(BSP_STATUS_OK, bsp_timer_cb_arg);
                bsp_timer_cb = NULL;
                bsp_timer_cb_arg = NULL;
            }
        }

        bsp_timer_has_started = !bsp_timer_has_started;
    }

    if (htim->Instance == TIM5)
    {
        // If LED is in blink mode
        if (bsp_ld2_led.mode == BSP_LED_MODE_BLINK)
        {
            // Increment LED blink counter
            bsp_ld2_led.blink_counter_100ms++;

            // If LED blink counter elapsed, then change LED state
            if (bsp_ld2_led.blink_counter_100ms >= bsp_ld2_led.blink_counter_100ms_max)
            {
                bsp_ld2_led.blink_counter_100ms = 0;

                // Change LED GPIO
                if (bsp_ld2_led.is_on)
                {
                    bsp_ld2_led.is_on = false;
                    bsp_set_gpio(BSP_GPIO_ID_LD2, GPIO_PIN_SET);
                }
                else
                {
                    bsp_ld2_led.is_on = true;
                    bsp_set_gpio(BSP_GPIO_ID_LD2, GPIO_PIN_RESET);
                }
            }
        }
    }

    bsp_irq_count++;

    return;
}

