wentong-li/sdk-nrf/applications/nrf5340_audio/ext/cirrus_logic/common/system_test_hw_0/hw_0_bsp.c
void HAL_I2C_MspInit(I2C_HandleTypeDef* hi2c)
{
    GPIO_InitTypeDef GPIO_InitStruct = {0};

    if(hi2c->Instance==I2C1)
    {
        __HAL_RCC_GPIOB_CLK_ENABLE();

        GPIO_InitStruct.Pin = GPIO_PIN_6|GPIO_PIN_7;
        GPIO_InitStruct.Mode = GPIO_MODE_AF_OD;
        GPIO_InitStruct.Pull = GPIO_PULLUP;
        GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
        GPIO_InitStruct.Alternate = GPIO_AF4_I2C1;
        HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

        __HAL_RCC_I2C1_CLK_ENABLE();

        HAL_NVIC_SetPriority(I2C1_ER_IRQn, 1, 0);
        HAL_NVIC_EnableIRQ(I2C1_ER_IRQn);
        HAL_NVIC_SetPriority(I2C1_EV_IRQn, 2, 0);
        HAL_NVIC_EnableIRQ(I2C1_EV_IRQn);
    }

    return;
}

void HAL_I2C_MspDeInit(I2C_HandleTypeDef* hi2c)
{
    if(hi2c->Instance==I2C1)
    {
        __HAL_RCC_I2C1_CLK_DISABLE();

        HAL_GPIO_DeInit(GPIOB, GPIO_PIN_6|GPIO_PIN_7);

        HAL_NVIC_DisableIRQ(I2C1_ER_IRQn);
        HAL_NVIC_DisableIRQ(I2C1_EV_IRQn);
    }

    return;
}

void HAL_I2C_MasterTxCpltCallback(I2C_HandleTypeDef *hi2c)
{
    if (HAL_I2C_GetState(hi2c) == HAL_I2C_STATE_READY)
    {
        if (bsp_i2c_current_transaction_type == BSP_I2C_TRANSACTION_TYPE_READ_REPEATED_START)
        {
            HAL_I2C_Master_Seq_Receive_IT(hi2c,
                                          bsp_i2c_read_address,
                                          bsp_i2c_read_buffer_ptr,
                                          bsp_i2c_read_length,
                                          I2C_LAST_FRAME);
        }
        else if (bsp_i2c_current_transaction_type == BSP_I2C_TRANSACTION_TYPE_WRITE)
        {
            bsp_i2c_transaction_complete = true;
            if (bsp_i2c_done_cb != NULL)
            {
                bsp_i2c_done_cb(BSP_STATUS_OK, bsp_i2c_done_cb_arg);
            }
        }
        else if (bsp_i2c_current_transaction_type == BSP_I2C_TRANSACTION_TYPE_DB_WRITE)
        {
            if (bsp_i2c_write_length == 0)
            {
                bsp_i2c_transaction_complete = true;
                if (bsp_i2c_done_cb != NULL)
                {
                    bsp_i2c_done_cb(BSP_STATUS_OK, bsp_i2c_done_cb_arg);
                }
            }
            else
            {
                HAL_I2C_Master_Seq_Transmit_IT(hi2c,
                                               bsp_i2c_read_address,
                                               bsp_i2c_write_buffer_ptr,
                                               bsp_i2c_write_length,
                                               I2C_LAST_FRAME);
                bsp_i2c_write_length = 0;
            }
        }
    }

    bsp_irq_count++;

    return;
}

void HAL_I2C_MasterRxCpltCallback(I2C_HandleTypeDef *hi2c)
{
    if (HAL_I2C_GetState(hi2c) == HAL_I2C_STATE_READY)
    {
        if (bsp_i2c_current_transaction_type != BSP_I2C_TRANSACTION_TYPE_INVALID)
        {
            bsp_i2c_transaction_complete = true;
            if (bsp_i2c_done_cb != NULL)
            {
                bsp_i2c_done_cb(BSP_STATUS_OK, bsp_i2c_done_cb_arg);
            }
        }
    }

    bsp_irq_count++;

    return;
}

void HAL_I2C_ErrorCallback(I2C_HandleTypeDef *hi2c)
{
    bsp_i2c_transaction_error = true;
    if (bsp_i2c_done_cb != NULL)
    {
        bsp_i2c_done_cb(BSP_STATUS_FAIL, bsp_i2c_done_cb_arg);
    }

    return;
}

void HAL_I2C_AbortCpltCallback(I2C_HandleTypeDef *hi2c)
{
    //Error_Handler();

    return;
}

void HAL_I2S_MspInit(I2S_HandleTypeDef *hi2s)
{
    static DMA_HandleTypeDef hdma_i2sTx;
    static DMA_HandleTypeDef hdma_i2sRx;
    GPIO_InitTypeDef  GPIO_InitStruct;

    if(hi2s->Instance == I2S_HW)
    {
        I2S_CLK_ENABLE();
        I2S_GPIO_PORT_CLK_ENABLE();

        GPIO_InitStruct.Pin         = I2S_LRCLK_GPIO_PIN | I2S_SCLK_GPIO_PIN | I2S_SDOUT_GPIO_PIN;
        GPIO_InitStruct.Mode        = GPIO_MODE_AF_PP;
        GPIO_InitStruct.Pull        = GPIO_NOPULL;
        GPIO_InitStruct.Speed       = GPIO_SPEED_FAST;
        GPIO_InitStruct.Alternate   = I2S_LRCLK_SCLK_SDOUT_AF;
        HAL_GPIO_Init(I2S_GPIO_PORT, &GPIO_InitStruct);

        GPIO_InitStruct.Pin         = I2S_SDIN_PIN;
        GPIO_InitStruct.Alternate   = I2S_SDIN_AF;
        HAL_GPIO_Init(I2S_GPIO_PORT, &GPIO_InitStruct);

        I2S_TX_DMAx_CLK_ENABLE();
        I2S_RX_DMAx_CLK_ENABLE();

        hdma_i2sTx.Init.Channel             = I2S_TX_DMAx_CHANNEL;
        hdma_i2sTx.Init.Direction           = DMA_MEMORY_TO_PERIPH;
        hdma_i2sTx.Init.PeriphInc           = DMA_PINC_DISABLE;
        hdma_i2sTx.Init.MemInc              = DMA_MINC_ENABLE;
        hdma_i2sTx.Init.PeriphDataAlignment = I2S_TX_DMAx_PERIPH_DATA_SIZE;
        hdma_i2sTx.Init.MemDataAlignment    = I2S_TX_DMAx_MEM_DATA_SIZE;
        hdma_i2sTx.Init.Mode                = DMA_CIRCULAR;
        hdma_i2sTx.Init.Priority            = DMA_PRIORITY_HIGH;
        hdma_i2sTx.Init.FIFOMode            = DMA_FIFOMODE_ENABLE;
        hdma_i2sTx.Init.FIFOThreshold       = DMA_FIFO_THRESHOLD_FULL;
        hdma_i2sTx.Init.MemBurst            = DMA_MBURST_SINGLE;
        hdma_i2sTx.Init.PeriphBurst         = DMA_PBURST_SINGLE;
        hdma_i2sTx.Instance                 = I2S_TX_DMAx_STREAM;

        hdma_i2sRx.Init.Channel             = I2S_RX_DMAx_CHANNEL;
        hdma_i2sRx.Init.Direction           = DMA_PERIPH_TO_MEMORY;
        hdma_i2sRx.Init.PeriphInc           = DMA_PINC_DISABLE;
        hdma_i2sRx.Init.MemInc              = DMA_MINC_ENABLE;
        hdma_i2sRx.Init.PeriphDataAlignment = I2S_RX_DMAx_PERIPH_DATA_SIZE;
        hdma_i2sRx.Init.MemDataAlignment    = I2S_RX_DMAx_MEM_DATA_SIZE;
        hdma_i2sRx.Init.Mode                = DMA_CIRCULAR;
        hdma_i2sRx.Init.Priority            = DMA_PRIORITY_HIGH;
        hdma_i2sRx.Init.FIFOMode            = DMA_FIFOMODE_ENABLE;
        hdma_i2sRx.Init.FIFOThreshold       = DMA_FIFO_THRESHOLD_FULL;
        hdma_i2sRx.Init.MemBurst            = DMA_MBURST_SINGLE;
        hdma_i2sRx.Init.PeriphBurst         = DMA_PBURST_SINGLE;
        hdma_i2sRx.Instance                 = I2S_RX_DMAx_STREAM;

        __HAL_LINKDMA(hi2s, hdmatx, hdma_i2sTx);
        HAL_DMA_DeInit(&hdma_i2sTx);
        HAL_DMA_Init(&hdma_i2sTx);

        __HAL_LINKDMA(hi2s, hdmarx, hdma_i2sRx);
        HAL_DMA_DeInit(&hdma_i2sRx);
        HAL_DMA_Init(&hdma_i2sRx);


        /* I2S DMA IRQ Channel configuration */
        HAL_NVIC_SetPriority(I2S_TX_DMAx_IRQ, I2S_TX_IRQ_PREPRIO, 0);
        HAL_NVIC_EnableIRQ(I2S_TX_DMAx_IRQ);

        HAL_NVIC_SetPriority(I2S_RX_DMAx_IRQ, I2S_RX_IRQ_PREPRIO, 0);
        HAL_NVIC_EnableIRQ(I2S_RX_DMAx_IRQ);
    }

    return;
}

