wentong-li/sdk-nrf/applications/nrf5340_audio/ext/cirrus_logic/common/system_test_hw_0/hw_0_bsp.c
void HAL_I2S_MspDeInit(I2S_HandleTypeDef *hi2s)
{
    GPIO_InitTypeDef  GPIO_InitStruct;

    HAL_NVIC_DisableIRQ(I2S_TX_DMAx_IRQ);
    HAL_NVIC_DisableIRQ(I2S_RX_DMAx_IRQ);

    if(hi2s->Instance == I2S_HW)
    {
        HAL_DMA_DeInit(hi2s->hdmatx);
        HAL_DMA_DeInit(hi2s->hdmarx);
    }

    __HAL_I2S_DISABLE(hi2s);

    GPIO_InitStruct.Pin = I2S_LRCLK_GPIO_PIN | I2S_SCLK_GPIO_PIN | I2S_SDOUT_GPIO_PIN | I2S_SDIN_PIN;
    HAL_GPIO_DeInit(I2S_GPIO_PORT, GPIO_InitStruct.Pin);

    I2S_CLK_DISABLE();

    return;
}

void HAL_I2S_TxCpltCallback(I2S_HandleTypeDef *hi2s)
{
    if(hi2s->Instance == I2S_HW)
    {
        bsp_audio_play(0);
    }

    bsp_irq_count++;

    return;
}

void HAL_I2S_TxHalfCpltCallback(I2S_HandleTypeDef *hi2s)
{
    return;
}

void HAL_I2S_RxCpltCallback(I2S_HandleTypeDef *hi2s)
{
    return;
}

void HAL_I2S_RxHalfCpltCallback(I2S_HandleTypeDef *hi2s)
{
    return;
}

void HAL_I2SEx_TxRxHalfCpltCallback(I2S_HandleTypeDef *hi2s)
{
    return;
}

void HAL_I2SEx_TxRxCpltCallback(I2S_HandleTypeDef *hi2s)
{
    if(hi2s->Instance == I2S_HW)
    {
        ;
    }

    bsp_irq_count++;

    return;
}

void HAL_I2S_ErrorCallback(I2S_HandleTypeDef *hi2s)
{
    if(hi2s->Instance == I2S_HW)
    {
        Error_Handler();
    }

    return;
}

void HAL_UART_MspInit(UART_HandleTypeDef *huart)
{
    GPIO_InitTypeDef  GPIO_InitStruct;

    USART2_TX_GPIO_CLK_ENABLE();
    USART2_RX_GPIO_CLK_ENABLE();

    USART2_CLK_ENABLE();

    GPIO_InitStruct.Pin       = USART2_TX_PIN;
    GPIO_InitStruct.Mode      = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull      = GPIO_PULLUP;
    GPIO_InitStruct.Speed     = GPIO_SPEED_FAST;
    GPIO_InitStruct.Alternate = USART2_TX_AF;

    HAL_GPIO_Init(USART2_TX_GPIO_PORT, &GPIO_InitStruct);

    GPIO_InitStruct.Pin = USART2_RX_PIN;
    GPIO_InitStruct.Alternate = USART2_RX_AF;

    HAL_GPIO_Init(USART2_RX_GPIO_PORT, &GPIO_InitStruct);

    HAL_NVIC_SetPriority(USART2_IRQn, USART2_IRQ_PREPRIO, 1);
    HAL_NVIC_EnableIRQ(USART2_IRQn);

    return;
}

void HAL_UART_MspDeInit(UART_HandleTypeDef *huart)
{
    USART2_FORCE_RESET();
    USART2_RELEASE_RESET();

    HAL_GPIO_DeInit(USART2_TX_GPIO_PORT, USART2_TX_PIN);
    HAL_GPIO_DeInit(USART2_RX_GPIO_PORT, USART2_RX_PIN);

    HAL_NVIC_DisableIRQ(USART2_IRQn);

    return;
}

void HAL_UART_TxCpltCallback(UART_HandleTypeDef *UartHandle)
{
    if (UartHandle->Instance == USART2)
    {
        // Update out_index
        uart_tx_fifo.out_index += UartHandle->TxXferSize;

        if (uart_tx_fifo.out_index >= uart_tx_fifo.size)
        {
            uart_tx_fifo.out_index = 0;
        }

        // Determine if buffer is not empty
        if (uart_tx_fifo.out_index != uart_tx_fifo.in_index)
        {
            // Calculate next TX size
            uint32_t tx_size_bytes = uart_tx_fifo.in_index;
            uint8_t *tx_buffer;

            if (uart_tx_fifo.in_index >= uart_tx_fifo.out_index)
            {
                tx_size_bytes = uart_tx_fifo.in_index - uart_tx_fifo.out_index;
            }
            else
            {
                tx_size_bytes = uart_tx_fifo.size - uart_tx_fifo.out_index;
            }

            tx_buffer = uart_tx_fifo.buffer + uart_tx_fifo.out_index;

            HAL_UART_Transmit_IT(UartHandle, tx_buffer, tx_size_bytes);
        }
    }

    return;
}

void HAL_UART_RxCpltCallback(UART_HandleTypeDef *UartHandle)
{
    if (UartHandle->Instance == USART2)
    {
        Error_Handler();
    }

    return;
}

 void HAL_UART_ErrorCallback(UART_HandleTypeDef *UartHandle)
{
    if (UartHandle->Instance == USART2)
    {
        Error_Handler();
    }

    return;
}

/***********************************************************************************************************************
 * API FUNCTIONS
 **********************************************************************************************************************/
#ifdef SEMIHOSTING
extern void initialise_monitor_handles(void);
#endif

uint32_t bsp_initialize(bsp_app_callback_t cb, void *cb_arg)
{
    app_cb = cb;
    app_cb_arg = cb_arg;

#ifdef SEMIHOSTING
    initialise_monitor_handles();
#endif
    /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
    HAL_Init();

    /* Configure the system clock */
    SystemClock_Config();

    // Configure LD2 LED
    bsp_set_gpio(BSP_GPIO_ID_LD2, GPIO_PIN_SET);
    bsp_ld2_led.is_on = true;
    bsp_ld2_led.blink_counter_100ms_max = 1;
    bsp_ld2_led.mode = BSP_LED_MODE_BLINK;

    uart_tx_fifo.buffer = uart_tx_buffer;
    uart_tx_fifo.size = USART2_TX_BUFFER_SIZE_BYTES;
    uart_tx_fifo.in_index = 0;
    uart_tx_fifo.out_index = 0;

    // Initialize playback buffer
    for (int i = 0; i < PLAYBACK_BUFFER_SIZE_2BYTES;)
    {
        record_buffer[i] = RECORD_BUFFER_DEFAULT_VALUE;
        playback_buffer[i] = i;
        i++;
        record_buffer[i] = RECORD_BUFFER_DEFAULT_VALUE;
        playback_buffer[i] = i;
        i++;
    }

    playback_content = playback_buffer;

    bsp_timer_cb = NULL;
    bsp_timer_cb_arg = NULL;
    bsp_timer_has_started = false;
    bsp_i2c_done_cb = NULL;
    bsp_i2c_done_cb_arg = NULL;
    bsp_i2c_current_transaction_type = BSP_I2C_TRANSACTION_TYPE_INVALID;

    for (int i = 0; i < BSP_PB_TOTAL; i++)
    {
        bsp_pb_pressed_flags[i] = false;
    }

    /* Initialize all peripheral drivers */
    Timer_Init();
    I2C_Init();
    MX_SPI1_Init();
    UART_Init();
    bsp_audio_set_fs(BSP_AUDIO_FS_48000_HZ);

    // Toggle LN2 Reset
    HAL_GPIO_WritePin(BSP_LN2_RESET_GPIO_PORT, BSP_LN2_RESET_PIN, GPIO_PIN_RESET);
    bsp_set_timer(5, NULL, NULL);
    HAL_GPIO_WritePin(BSP_LN2_RESET_GPIO_PORT, BSP_LN2_RESET_PIN, GPIO_PIN_SET);
    bsp_set_timer(5000, NULL, NULL);

    return BSP_STATUS_OK;
}

void bsp_notification_callback(uint32_t event_flags, void *arg)
{
    bsp_toggle_gpio(BSP_GPIO_ID_LD2);
    bsp_toggle_gpio(BSP_GPIO_ID_LD2);
    return;
}

uint32_t bsp_audio_set_fs(uint32_t fs_hz)
{
    if ((fs_hz != 48000) && (fs_hz != 44100))
    {
        return BSP_STATUS_FAIL;
    }

    I2S_Deinit();

    I2S_Init(fs_hz);

    return BSP_STATUS_OK;
}

uint32_t bsp_audio_play(uint8_t content)
{
    switch (content)
    {
        case BSP_PLAY_SILENCE:
#if (BSP_I2S_2BYTES_PER_SUBFRAME == 2)
            playback_content = (uint16_t *) pcm_silence_32bit_stereo_single_period;
#else
            playback_content = pcm_silence_16bit_stereo_single_period;
#endif
            break;

        case BSP_PLAY_STEREO_1KHZ_20DBFS:
#if (BSP_I2S_2BYTES_PER_SUBFRAME == 2)
            playback_content = (uint16_t *) pcm_20dBFs_1kHz_32bit_stereo_single_period;
#else
            playback_content = pcm_20dBFs_1kHz_16bit_stereo_single_period;
#endif
            break;

        case BSP_PLAY_STEREO_100HZ_20DBFS:
#ifdef TEST_TONES_INCLUDE_100HZ
#if (BSP_I2S_2BYTES_PER_SUBFRAME == 2)
            playback_content = pcm_20dBFs_100Hz_32bit_stereo_single_period;
#else
            playback_content = pcm_20dBFs_100Hz_16bit_stereo_single_period;
#endif
#else
            return BSP_STATUS_FAIL;
#endif
            break;

        default:
        case BSP_PLAY_STEREO_PATTERN:
            playback_content = playback_buffer;
            break;
    }

