wentong-li/sdk-nrf/applications/nrf5340_audio/ext/cirrus_logic/common/system_test_hw_0/hw_0_bsp.c
    if (HAL_OK == HAL_I2S_Transmit_DMA(&i2s_drv_handle, playback_content, BSP_I2S_DMA_SIZE))
    {
        return BSP_STATUS_OK;
    }
    else
    {
        return BSP_STATUS_FAIL;
    }
}

uint32_t bsp_audio_record(void)
{
    if (HAL_OK == HAL_I2S_Receive_DMA(&i2s_drv_handle, record_buffer, BSP_I2S_DMA_SIZE))
    {
        return BSP_STATUS_OK;
    }
    else
    {
        return BSP_STATUS_FAIL;
    }
}

uint32_t bsp_audio_play_record(uint8_t content)
{
    uint16_t dma_transfer_size = 0;
    switch (content)
    {
        case BSP_PLAY_SILENCE:
            dma_transfer_size = PCM_1KHZ_SINGLE_PERIOD_LENGTH_2BYTES;
#if (BSP_I2S_2BYTES_PER_SUBFRAME == 2)
            playback_content = (uint16_t *) pcm_silence_32bit_stereo_single_period;
#else
            playback_content = pcm_silence_16bit_stereo_single_period;
#endif
            break;

        case BSP_PLAY_STEREO_1KHZ_20DBFS:
            dma_transfer_size = PCM_1KHZ_SINGLE_PERIOD_LENGTH_2BYTES;
#if (BSP_I2S_2BYTES_PER_SUBFRAME == 2)
            playback_content = (uint16_t *) pcm_20dBFs_1kHz_32bit_stereo_single_period;
#else
            playback_content = pcm_20dBFs_1kHz_16bit_stereo_single_period;
#endif
            break;

        case BSP_PLAY_STEREO_100HZ_20DBFS:
#ifdef TEST_TONES_INCLUDE_100HZ
#if (BSP_I2S_2BYTES_PER_SUBFRAME == 2)
            playback_content = pcm_20dBFs_100Hz_32bit_stereo_single_period;
#else
            playback_content = pcm_20dBFs_100Hz_16bit_stereo_single_period;
#endif
#else
            return BSP_STATUS_FAIL;
#endif
            break;

        default:
        case BSP_PLAY_STEREO_PATTERN:
            playback_content = playback_buffer;
            break;
    }

    if (HAL_OK == HAL_I2SEx_TransmitReceive_DMA(&i2s_drv_handle, playback_content, record_buffer, dma_transfer_size))
    {
        return BSP_STATUS_OK;
    }
    else
    {
        return BSP_STATUS_FAIL;
    }
}

uint32_t bsp_audio_pause(void)
{
    if (HAL_OK == HAL_I2S_DMAPause(&i2s_drv_handle))
    {
        return BSP_STATUS_OK;
    }
    else
    {
        return BSP_STATUS_FAIL;
    }
}

uint32_t bsp_audio_resume(void)
{
    if (HAL_OK == HAL_I2S_DMAResume(&i2s_drv_handle))
    {
        return BSP_STATUS_OK;
    }
    else
    {
        return BSP_STATUS_FAIL;
    }
}

uint32_t bsp_audio_stop(void)
{
    if (HAL_OK == HAL_I2S_DMAStop(&i2s_drv_handle))
    {
        return BSP_STATUS_OK;
    }
    else
    {
        return BSP_STATUS_FAIL;
    }
}

bool bsp_was_pb_pressed(uint8_t pb_id)
{
    bool ret = bsp_pb_pressed_flags[pb_id];
    if (ret)
    {
        bsp_pb_pressed_flags[pb_id] = false;
    }

    return ret;
}

uint32_t bsp_set_timer(uint32_t duration_ms, bsp_callback_t cb, void *cb_arg)
{
    bsp_timer_cb = cb;
    bsp_timer_cb_arg = cb_arg;
    bsp_timer_has_started = false;
    bsp_timer_elapsed = false;

    Timer_Start(duration_ms * 10);
    if (cb == NULL)
    {
        while (!bsp_timer_elapsed);
    }

    return BSP_STATUS_OK;
}

uint32_t bsp_set_gpio(uint32_t gpio_id, uint8_t gpio_state)
{
    switch (gpio_id)
    {
        case BSP_GPIO_ID_LD2:
            HAL_GPIO_WritePin(GPIOA, GPIO_PIN_5, (GPIO_PinState) gpio_state);
            break;

        case BSP_GPIO_ID_DUT_CDC_RESET:
        {
            uint32_t temp_buffer = 0x00DF0000;
            if (gpio_state == BSP_GPIO_LOW)
            {
                temp_buffer |= 0x1;
            }

            temp_buffer = __builtin_bswap32(temp_buffer);

            bsp_i2c_write(BSP_LN2_DEV_ID, (uint8_t *)&temp_buffer, 4, NULL, NULL);
            break;
        }

        case BSP_GPIO_ID_DUT_DSP_RESET:
            HAL_GPIO_WritePin(BSP_DUT_RESET_GPIO_PORT, BSP_DUT_DSP_RESET_PIN, (GPIO_PinState) gpio_state);
            break;

        case BSP_GPIO_ID_GF_GPIO7:
            HAL_GPIO_WritePin(GPIOC, GPIO_PIN_5, (GPIO_PinState) gpio_state);
            break;

        case BSP_GPIO_ID_GF_GPIO2:
            HAL_GPIO_WritePin(GPIOC, GPIO_PIN_2, (GPIO_PinState) gpio_state);
            break;

        default:
            break;
    }

    return BSP_STATUS_OK;
}

uint32_t bsp_set_supply(uint32_t supply_id, uint8_t supply_state)
{
    uint8_t tmp[4] = {0x01, 0x1E, 0x00, 0x00};

    switch (supply_id)
    {
        case BSP_SUPPLY_ID_LN2_DCVDD:
            tmp[2] = supply_state ? 0x80 : 0x0;
            bsp_i2c_write(BSP_LN2_DEV_ID, tmp, 4, NULL, NULL);
            // Wait 15ms for supply to finish rising/falling
            bsp_set_timer(15, NULL, NULL);
            break;

        default:
            break;
    }

    return BSP_STATUS_OK;
}

uint32_t bsp_toggle_gpio(uint32_t gpio_id)
{
    switch (gpio_id)
    {
        case BSP_GPIO_ID_LD2:
            HAL_GPIO_TogglePin(GPIOA, GPIO_PIN_5);
            break;

        default:
            break;
    }

    return BSP_STATUS_OK;
}

uint32_t bsp_spi_read(uint32_t bsp_dev_id,
                      uint8_t *addr_buffer,
                      uint32_t addr_length,
                      uint8_t *data_buffer,
                      uint32_t data_length,
                      uint32_t pad_len)
{
    uint8_t padding[4] = { 0x0 };
    HAL_StatusTypeDef ret;
    GPIO_TypeDef *cs_gpio_per;
    uint32_t cs_gpio_pin;

    if (pad_len > 4)
            return BSP_STATUS_FAIL;

    // Select appropriate GPIO peripheral and pin for CS depending on device making request
    switch (bsp_dev_id)
    {
        case BSP_DUT_DEV_ID_SPI2:
            cs_gpio_per = GPIOA;
            cs_gpio_pin = GPIO_PIN_11;
            break;
        case BSP_DUT_DEV_ID:
            cs_gpio_per = GPIOA;
            cs_gpio_pin = GPIO_PIN_15;
            break;
        default:
            return BSP_STATUS_FAIL;
    }

    // Chip select low
    HAL_GPIO_WritePin(cs_gpio_per, cs_gpio_pin, GPIO_PIN_RESET);

    // Transmit R/W bit + register addr
    ret = HAL_SPI_Transmit(&hspi1, addr_buffer, addr_length, HAL_MAX_DELAY);
    if (ret)
        return BSP_STATUS_FAIL;

    if (pad_len)
    {
        // Transmit Padding
        ret = HAL_SPI_Transmit(&hspi1, padding, pad_len, HAL_MAX_DELAY);
        if (ret)
            return BSP_STATUS_FAIL;
    }

    // Receive value
    ret = HAL_SPI_Receive(&hspi1, data_buffer, data_length, HAL_MAX_DELAY);
    if (ret)
        return BSP_STATUS_FAIL;

    HAL_GPIO_WritePin(cs_gpio_per, cs_gpio_pin, GPIO_PIN_SET);

    return BSP_STATUS_OK;
}

uint32_t bsp_spi_write(uint32_t bsp_dev_id,
                      uint8_t *addr_buffer,
                      uint32_t addr_length,
                      uint8_t *data_buffer,
                      uint32_t data_length,
                      uint32_t pad_len)
{
    uint8_t padding[4] = { 0x0 };
    HAL_StatusTypeDef ret;
    GPIO_TypeDef * cs_gpio_per;
    uint32_t cs_gpio_pin;

    if (pad_len > 4)
            return BSP_STATUS_FAIL;

