wentong-li/sdk-nrf/applications/nrf5340_audio/ext/cirrus_logic/common/system_test_hw_0/hw_0_bsp.c
    // Select appropriate GPIO peripheral and pin for CS depending on device making request
    switch (bsp_dev_id)
    {
        case BSP_DUT_DEV_ID_SPI2:
            cs_gpio_per = GPIOA;
            cs_gpio_pin = GPIO_PIN_11;
            break;
        case BSP_DUT_DEV_ID:
            cs_gpio_per = GPIOA;
            cs_gpio_pin = GPIO_PIN_15;
            break;
        default:
            return BSP_STATUS_FAIL;
    }

    // Chip select low
    HAL_GPIO_WritePin(cs_gpio_per, cs_gpio_pin, GPIO_PIN_RESET);

    // Transmit R/W bit + register addr
    ret = HAL_SPI_Transmit(&hspi1, addr_buffer, addr_length, HAL_MAX_DELAY);
    if (ret)
        return BSP_STATUS_FAIL;

    if (pad_len)
    {
        // Transmit Padding
        ret = HAL_SPI_Transmit(&hspi1, padding, pad_len, HAL_MAX_DELAY);
        if (ret)
            return BSP_STATUS_FAIL;
    }

    // Transmit data
    ret = HAL_SPI_Transmit(&hspi1, data_buffer, data_length, HAL_MAX_DELAY);
    if (ret)
        return BSP_STATUS_FAIL;

    // Chip select high
    HAL_GPIO_WritePin(cs_gpio_per, cs_gpio_pin, GPIO_PIN_SET);

    return BSP_STATUS_OK;
}

uint32_t bsp_i2c_read_repeated_start(uint32_t bsp_dev_id,
                                     uint8_t *write_buffer,
                                     uint32_t write_length,
                                     uint8_t *read_buffer,
                                     uint32_t read_length,
                                     bsp_callback_t cb,
                                     void *cb_arg)
{
    switch (bsp_dev_id)
    {
        case BSP_DUT_DEV_ID:
            bsp_i2c_transaction_complete = false;
            bsp_i2c_done_cb = cb;
            bsp_i2c_done_cb_arg = cb_arg;
            bsp_i2c_current_transaction_type = BSP_I2C_TRANSACTION_TYPE_READ_REPEATED_START;
            bsp_i2c_read_buffer_ptr = read_buffer;
            bsp_i2c_read_length = read_length;
            bsp_i2c_read_address = BSP_DUT_I2C_ADDRESS_8BIT;
            HAL_I2C_Master_Seq_Transmit_IT(&i2c_drv_handle,
                                           bsp_i2c_read_address,
                                           write_buffer,
                                           write_length,
                                           I2C_FIRST_FRAME);

            if (cb == NULL)
            {
                while (!bsp_i2c_transaction_complete);
            }

            break;

#ifdef BSP_LN2_DEV_ID
        case BSP_LN2_DEV_ID:
            bsp_i2c_transaction_complete = false;
            bsp_i2c_done_cb = cb;
            bsp_i2c_done_cb_arg = cb_arg;
            bsp_i2c_current_transaction_type = BSP_I2C_TRANSACTION_TYPE_READ_REPEATED_START;
            bsp_i2c_read_buffer_ptr = read_buffer;
            bsp_i2c_read_length = read_length;
            bsp_i2c_read_address = BSP_LN2_FPGA_I2C_ADDRESS_8BIT;
            HAL_I2C_Master_Seq_Transmit_IT(&i2c_drv_handle,
                                           bsp_i2c_read_address,
                                           write_buffer,
                                           write_length,
                                           I2C_FIRST_FRAME);

            if (cb == NULL)
            {
                while (!bsp_i2c_transaction_complete);
            }

            break;
#endif

        default:
            break;
    }

    return BSP_STATUS_OK;
}

uint32_t bsp_i2c_write(uint32_t bsp_dev_id,
                       uint8_t *write_buffer,
                       uint32_t write_length,
                       bsp_callback_t cb,
                       void *cb_arg)
{
    uint32_t ret = BSP_STATUS_OK;

    switch (bsp_dev_id)
    {
        case BSP_DUT_DEV_ID:
        case BSP_DUT_DEV_ID_SPI2:
            bsp_i2c_transaction_complete = false;
            bsp_i2c_transaction_error = false;
            bsp_i2c_done_cb = cb;
            bsp_i2c_done_cb_arg = cb_arg;
            bsp_i2c_current_transaction_type = BSP_I2C_TRANSACTION_TYPE_WRITE;
            HAL_I2C_Master_Seq_Transmit_IT(&i2c_drv_handle,
                                           BSP_DUT_I2C_ADDRESS_8BIT,
                                           write_buffer,
                                           write_length,
                                           I2C_FIRST_AND_LAST_FRAME);

            if (cb == NULL)
            {
                while ((!bsp_i2c_transaction_complete) && (!bsp_i2c_transaction_error));
                if (bsp_i2c_transaction_error)
                {
                    ret = BSP_STATUS_FAIL;
                }
            }
            break;

#ifdef BSP_LN2_DEV_ID
        case BSP_LN2_DEV_ID:
            bsp_i2c_transaction_complete = false;
            bsp_i2c_transaction_error = false;
            bsp_i2c_done_cb = cb;
            bsp_i2c_done_cb_arg = cb_arg;
            bsp_i2c_current_transaction_type = BSP_I2C_TRANSACTION_TYPE_WRITE;
            HAL_I2C_Master_Seq_Transmit_IT(&i2c_drv_handle,
                                           BSP_LN2_FPGA_I2C_ADDRESS_8BIT,
                                           write_buffer,
                                           write_length,
                                           I2C_FIRST_AND_LAST_FRAME);

            if (cb == NULL)
            {
                while ((!bsp_i2c_transaction_complete) && (!bsp_i2c_transaction_error));
                if (bsp_i2c_transaction_error)
                {
                    ret = BSP_STATUS_FAIL;
                }
            }

            break;
#endif

        default:
            break;
    }

    return ret;
}

uint32_t bsp_i2c_db_write(uint32_t bsp_dev_id,
                          uint8_t *write_buffer_0,
                          uint32_t write_length_0,
                          uint8_t *write_buffer_1,
                          uint32_t write_length_1,
                          bsp_callback_t cb,
                          void *cb_arg)
{
    switch (bsp_dev_id)
    {
        case BSP_DUT_DEV_ID:
        case BSP_DUT_DEV_ID_SPI2:
            bsp_i2c_transaction_complete = false;
            bsp_i2c_done_cb = cb;
            bsp_i2c_done_cb_arg = cb_arg;
            bsp_i2c_read_address = BSP_DUT_I2C_ADDRESS_8BIT;
            bsp_i2c_write_length = write_length_1;
            bsp_i2c_write_buffer_ptr = write_buffer_1;
            bsp_i2c_current_transaction_type = BSP_I2C_TRANSACTION_TYPE_DB_WRITE;

            HAL_I2C_Master_Seq_Transmit_IT(&i2c_drv_handle, bsp_i2c_read_address, write_buffer_0, write_length_0, I2C_FIRST_FRAME);

            if (cb == NULL)
            {
                while (!bsp_i2c_transaction_complete);
            }

            break;

        default:
            break;
    }

    return BSP_STATUS_OK;
}

uint32_t bsp_register_gpio_cb(uint32_t gpio_id, bsp_callback_t cb, void *cb_arg)
{
    switch (gpio_id)
    {
        case BSP_GPIO_ID_DUT_CDC_INT:
            bsp_dut_cdc_int_cb = cb;
            bsp_dut_cdc_int_cb_arg = cb_arg;
            break;

        case BSP_GPIO_ID_DUT_DSP_INT:
            bsp_dut_dsp_int_cb = cb;
            bsp_dut_dsp_int_cb_arg = cb_arg;
            break;

        default:
            return BSP_STATUS_FAIL;
    }

    return BSP_STATUS_OK;
}

uint32_t bsp_i2c_reset(uint32_t bsp_dev_id, bool *was_i2c_busy)
{
    if (was_i2c_busy != NULL)
    {
        *was_i2c_busy = false;
    }

