wentong-li/sdk-nrf/applications/nrf5340_audio/ext/cirrus_logic/common/system_test_hw_0/hw_0_bsp.c
    if (HAL_I2C_GetState(&i2c_drv_handle) != HAL_I2C_STATE_READY)
    {
        if (was_i2c_busy != NULL)
        {
            *was_i2c_busy = true;
        }

        switch (bsp_dev_id)
        {
            case BSP_DUT_DEV_ID:
            case BSP_DUT_DEV_ID_SPI2:
                HAL_I2C_Master_Abort_IT(&i2c_drv_handle, BSP_DUT_I2C_ADDRESS_8BIT);
                break;

            default:
                break;
        }
    }

    return BSP_STATUS_OK;
}

uint32_t bsp_enable_irq(void)
{
    __enable_irq();
    return BSP_STATUS_OK;
}

uint32_t bsp_disable_irq(void)
{
    __disable_irq();
    return BSP_STATUS_OK;
}

void bsp_sleep(void)
{
    __disable_irq();
    bsp_irq_count--;

    if (bsp_irq_count <= 0)
    {
        bsp_irq_count = 0;
        __enable_irq();
        __WFI();
    }
    else
    {
        __enable_irq();
    }

    return;
}

uint32_t bsp_register_pb_cb(uint32_t pb_id, bsp_app_callback_t cb, void *cb_arg)
{
    if (pb_id < BSP_PB_TOTAL)
    {
        bsp_pb_cbs[pb_id] = cb;
        bsp_pb_cb_args[pb_id] = cb_arg;
        return BSP_STATUS_OK;
    }
    else
    {
        return BSP_STATUS_FAIL;
    }
}

uint32_t bsp_spi_throttle_speed(uint32_t speed_hz)
{
    uint32_t ret = BSP_STATUS_OK;
    uint32_t spi_baud_hz = HAL_RCC_GetPCLK2Freq();  // Currently using SPI1 which is on APB2
    uint32_t temp_spi_baud_prescaler;

    // Save the current prescaler value
    spi_baud_prescaler = temp_spi_baud_prescaler = (hspi1.Init.BaudRatePrescaler >> SPI_CR1_BR_Pos);
    // Get the current SPI Baud in Hz
    spi_baud_hz >>= (temp_spi_baud_prescaler + 1);

    // Check to see if any throttling is needed
    if (speed_hz < spi_baud_hz)
    {
        // Decrement the SPI baud until a rate slow enough is found
        while ((speed_hz < spi_baud_hz) && (temp_spi_baud_prescaler < (SPI_BAUDRATEPRESCALER_256 >> SPI_CR1_BR_Pos)))
        {
            spi_baud_hz >>= 1;
            temp_spi_baud_prescaler++;
        }

        // If no slower SPI baud was found
        if ((speed_hz < spi_baud_hz) && (temp_spi_baud_prescaler >= (SPI_BAUDRATEPRESCALER_256 >> SPI_CR1_BR_Pos)))
        {
            ret = BSP_STATUS_FAIL;
        }
        else
        {
            if (HAL_SPI_DeInit(&hspi1) != HAL_OK)
            {
                Error_Handler();
            }

            hspi1.Init.BaudRatePrescaler = (temp_spi_baud_prescaler << SPI_CR1_BR_Pos);
            if (HAL_SPI_Init(&hspi1) != HAL_OK)
            {
                Error_Handler();
            }
        }

    }

    return ret;
}

uint32_t bsp_spi_restore_speed(void)
{
    // If the SPI baud rate was changed, restore it
    if (spi_baud_prescaler != (hspi1.Init.BaudRatePrescaler >> SPI_CR1_BR_Pos))
    {
        if (HAL_SPI_DeInit(&hspi1) != HAL_OK)
        {
            Error_Handler();
        }

        hspi1.Init.BaudRatePrescaler = (spi_baud_prescaler << SPI_CR1_BR_Pos);
        if (HAL_SPI_Init(&hspi1) != HAL_OK)
        {
            Error_Handler();
        }
    }

    return BSP_STATUS_OK;
}

void* bsp_malloc(size_t size)
{
#ifdef NO_OS
    return malloc(size);
#else
    return pvPortMalloc(size);
#endif
}

void bsp_free(void* ptr)
{
#ifdef NO_OS
    return free(ptr);
#else
    return vPortFree(ptr);
#endif
}

uint32_t bsp_set_ld2(uint8_t mode, uint32_t blink_100ms)
{
    if (mode == BSP_LD2_MODE_BLINK)
    {
        bsp_ld2_led.blink_counter_100ms_max = blink_100ms;
        bsp_ld2_led.mode = BSP_LED_MODE_BLINK;
    }
    else
    {
        bsp_ld2_led.mode = BSP_LED_MODE_FIXED;
        if (mode == BSP_LD2_MODE_OFF)
        {
            bsp_set_gpio(BSP_GPIO_ID_LD2, GPIO_PIN_RESET);
            bsp_ld2_led.is_on = false;
        }
        else
        {
            bsp_set_gpio(BSP_GPIO_ID_LD2, GPIO_PIN_SET);
            bsp_ld2_led.is_on = true;
        }
    }

    return BSP_STATUS_OK;
}

static bsp_driver_if_t bsp_driver_if_s =
{
    .set_gpio = &bsp_set_gpio,
    .set_supply = &bsp_set_supply,
    .register_gpio_cb = &bsp_register_gpio_cb,
    .set_timer = &bsp_set_timer,
    .i2c_read_repeated_start = &bsp_i2c_read_repeated_start,
    .i2c_write = &bsp_i2c_write,
    .i2c_db_write = &bsp_i2c_db_write,
    .spi_read = &bsp_spi_read,
    .spi_write = &bsp_spi_write,
    .i2c_reset = &bsp_i2c_reset,
    .enable_irq = &bsp_enable_irq,
    .disable_irq = &bsp_disable_irq,
    .spi_throttle_speed = &bsp_spi_throttle_speed,
    .spi_restore_speed = &bsp_spi_restore_speed
};

bsp_driver_if_t *bsp_driver_if_g = &bsp_driver_if_s;
